src/projects/configuration/251027_GKSTCPLK-1788/src/DataProcessors/гкс_АРМПромежуточныйКомпозит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМПромежуточныйКомпозит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Documents/гкс_ФормированиеНомераПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_ФормированиеНомераПробы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПробы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_НомерПробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Comment>ERP-1431</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/DataProcessors/гкс_АРМПромежуточныйКомпозит/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьРеквизитыФормы();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйКомпозит;
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборТочкаМаршрутаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидПеревозкиПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Подключить = ПроверитьОсновныеОтборы();
	ОбработчикОжидания(Подключить);
	
КонецПроцедуры

&НаКлиенте
Процедура СуткиПриИзменении(Элемент)
	ОбновитьПериодИФорму();
КонецПроцедуры


&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокУсиленныйКонтроль

&НаКлиенте
Процедура СписокСписокУсиленныйКонтрольВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокСписокУсиленныйКонтрольПометка Тогда
		ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПроизвольныйКомпозит

&НаКлиенте
Процедура СписокПроизвольныйКомпозитВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	
	Если Поле = Элементы.СписокПроизвольныйКомпозитПометка Тогда
		
		// Проверка совпадения номенклатуры и контрагента при активации пометки
		Если НЕ ТекущиеДанные.Пометка Тогда
			ПерваяОтмеченнаяСтрока = НайтиПервуюОтмеченнуюСтроку();
			
			Если ПерваяОтмеченнаяСтрока <> Неопределено Тогда
				МожноПродолжить = ПроверитьСовпадениеДанныхСПервойСтрокой(ТекущиеДанные, ПерваяОтмеченнаяСтрока);
				Если НЕ МожноПродолжить Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПромежуточныеПробы
&НаКлиенте
Процедура СписокПромежуточныеПробыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Определяем документ и форму в зависимости от поля
	Если Поле.Имя = "СписокПромежуточныеПробыЛабораторныйАнализНомер" Тогда
		ДокументОткрытия = ТекущиеДанные.ПромежуточныйКомпозит;
		ИмяФормыДокумента = "Документ.гкс_ЛабораторныйАнализ.Форма.ФормаДокумента";
	ИначеЕсли Поле.Имя = "СписокПромежуточныеПробыНомерПробы" Тогда
		ДокументОткрытия = ТекущиеДанные.ДокументКомпозитнаяПроба;
		ИмяФормыДокумента = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
	КонецЕсли;

	// Открываем документ, если он заполнен
	Если ЗначениеЗаполнено(ДокументОткрытия) Тогда
		гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ДокументОткрытия, ИмяФормыДокумента, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПромежуточныеПробыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДокументФормированиеНомераПробы", ТекущиеДанные.ДокументКомпозитнаяПроба);
	
	СписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаУбавитьСутки(Команда)
	
	ДобавитьСутки(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСутки(Команда)
	
	ДобавитьСутки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьПробыУсиленныйКонтроль(Команда)
	// Заглушка - функционал не реализован
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЭтикеткиУсиленныйКонтроль(Команда)
	// Заглушка - функционал не реализован
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьУсиленныйКонтроль(Команда)
	// Заглушка - функционал не реализован
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроизвольныйКомпозит(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЭтикетки(Команда)
	ТекущиеДанные = Неопределено;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит" Тогда
		ТекущиеДанные = Элементы.СписокПроизвольныйКомпозит.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы" Тогда
		ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Не отмечена проба'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КомпозитнаяПроба = ТекущиеДанные.ДокументКомпозитнаяПроба;
	Если НЕ ЗначениеЗаполнено(КомпозитнаяПроба) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена композитная проба'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(КомпозитнаяПроба);
	
	АвтоматическаяПечатьЭтикеток = гкс_ОбщегоНазначенияВызовСервера.ЗначениеКонстанты(
			"гкс_АвтоматическаяПечатьЭтикеток");
	
	Если АвтоматическаяПечатьЭтикеток Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("АвтоматическаяПечатьЭтикеток", АвтоматическаяПечатьЭтикеток);
		
		гкс_УправлениеПечатьюКлиент.ПечатьЭтикеткаНаПринтер(
			"Документ.гкс_ФормированиеНомераПробы", "ПФ_MXL_Этикетка", МассивОбъектов, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.гкс_ФормированиеНомераПробы",
			"ПФ_MXL_Этикетка", МассивОбъектов, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьПробыПроизвольныйКомпозит(Команда)
	

	// Получаем все отмеченные строки с использованием поиска
	ОтборПоПометке = Новый Структура("Пометка", Истина);
	НайденныеСтроки = СписокПроизвольныйКомпозит.НайтиСтроки(ОтборПоПометке);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не выбрано ни одной строки для формирования проб'"));
		Возврат;
	КонецЕсли;

	// Анализируем отмеченные строки:
	// Если найден документ - открываем его для редактирования
	// Иначе - собираем строки без документа для создания нового
	ОтмеченныеСтроки = Новый Массив;
	ДокументКомпозитнаяПроба = Неопределено;

	Для Каждого СтрокаСписка Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.ДокументКомпозитнаяПроба) Тогда
			// Найден документ - сохраняем и прерываем
			ДокументКомпозитнаяПроба = СтрокаСписка.ДокументКомпозитнаяПроба;
			Прервать;
		Иначе
			// Строка без документа - добавляем для создания нового
			ОтмеченныеСтроки.Добавить(СтрокаСписка);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ДопПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ОбработчикОжиданияСписок", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ДокументКомпозитнаяПроба) Тогда
		
		ПараметрыОткрытия.Вставить("Ключ", ДокументКомпозитнаяПроба);
		ИмяФормыДокумента = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
		
	Иначе
		ТипПробыКомпозитная = ПредопределенноеЗначение("Перечисление.гкс_ТипыПроб.Композитная");
		
		// Формируем массив структур из всех отмеченных строк
		МассивСтрокДанных = Новый Массив;
		Для Каждого СтрокаДанных Из ОтмеченныеСтроки Цикл
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("ДокументРегистрации", СтрокаДанных.ДокументРегистрации);
			МассивСтрокДанных.Добавить(СтруктураСтроки);
		КонецЦикла;
		
		ДопПараметры.Вставить("Номенклатура", ОтмеченныеСтроки[0].Номенклатура);
		ДопПараметры.Вставить("Контрагент", ОтмеченныеСтроки[0].Контрагент);
		ДопПараметры.Вставить("Организация", ОтмеченныеСтроки[0].Организация);
		ДопПараметры.Вставить("ПунктПогрузки", ОтмеченныеСтроки[0].ПунктПогрузки);
		ДопПараметры.Вставить("СтанцияОтправления", ОтмеченныеСтроки[0].СтанцияОтправления);
		ДопПараметры.Вставить("СтанцияОтправленияПредставление", ОтмеченныеСтроки[0].СтанцияОтправленияПредставление);
		
		ДопПараметры.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);
		ДопПараметры.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		ДопПараметры.Вставить("МассивСтрокДанных", МассивСтрокДанных);
		ДопПараметры.Вставить("НачалоПериода", НачалоПериода);
		ДопПараметры.Вставить("КонецПериода", КонецПериода);
		ДопПараметры.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
		ДопПараметры.Вставить("ТипПробы", ТипПробыКомпозитная);
		
		ПараметрыОткрытия.Вставить("ДопПараметры", ДопПараметры);
		
		ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
		ПараметрыОткрытия.Вставить("СтраницаПроизвольныйКомпозит",
			ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит");
		ПараметрыОткрытия.Вставить("СтраницаПромежуточныеПробы", ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы");
		
		ИмяФормыДокумента = "Обработка.гкс_АРМПромежуточныйКомпозит.Форма.ФормаФормированиеКомпозитнойФормы";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыДокумента, ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект, , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьЛабораторныйАнализ(Команда)
		ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКлючевойОперации = "АРМКомпозитныеПробы.ДокументЛабораторныйАнализ.ОткрытиеФормы";
	
	Оповещение = Новый ОписаниеОповещения("ОбработчикОжиданияСписок", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПромежуточныйКомпозит) Тогда
		
		ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.ПромежуточныйКомпозит);
		
		ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяКлючевойОперации);
	
		ОткрытьФорму("Документ.гкс_ЛабораторныйАнализ.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект, , , 
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПромежуточныеПробы(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НайтиПервуюОтмеченнуюСтроку()
	
	Для Каждого СтрокаСписка Из СписокПроизвольныйКомпозит Цикл
		Если СтрокаСписка.Пометка Тогда
			Возврат СтрокаСписка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

&НаКлиенте
Функция ПроверитьСовпадениеДанныхСПервойСтрокой(ТекущиеДанные, ПерваяОтмеченнаяСтрока)
	
	МассивНесовпадений = Новый Массив;
	
	// Проверяем номенклатуру
	Если ТекущиеДанные.Номенклатура <> ПерваяОтмеченнаяСтрока.Номенклатура Тогда
		// Формируем текст сообщения по аналогии с контрагентом
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Выбранная строка имеет отличающиеся данные от первой отмеченной строки:%1- Номенклатура'"),
			Символы.ПС);
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	// Проверяем контрагента
	Если ТекущиеДанные.Контрагент <> ПерваяОтмеченнаяСтрока.Контрагент Тогда
		МассивНесовпадений.Добавить("Контрагент");
	КонецЕсли;
	
	Если ТекущиеДанные.Организация <> ПерваяОтмеченнаяСтрока.Организация Тогда
		МассивНесовпадений.Добавить("Организация");
	КонецЕсли;
	
	// Выводим сообщение при наличии несовпадений
	Если МассивНесовпадений.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выбранная строка имеет отличающиеся данные от первой отмеченной строки:'");

		Для Каждого Несовпадение Из МассивНесовпадений Цикл
			ТекстСообщения = СтрШаблон("%1%2- %3", ТекстСообщения, Символы.ПС, Несовпадение);
		КонецЦикла;

		ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, НСтр("ru = 'Продолжить?'"));
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса", ЭтотОбъект, 
			ДополнительныеПараметры);
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, Режим, 0, , "Несовпадение данных");
		
		Возврат Ложь;

	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериодИФорму()
	УстановитьПериод();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()

	Видимость = ПроверитьОсновныеОтборы();

	Элементы.ГруппаСтраницы.Видимость = Видимость;
	Элементы.ГруппаОбщиеОтборы.Видимость = Видимость;

	ОбработчикОжидания(Видимость);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжидания(Подключить)
	Если Подключить Тогда
		ИнтервалОбработки = 0.5;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", ИнтервалОбработки, Истина);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСписок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОсновныеОтборы()
	Возврат ЗначениеЗаполнено(Объект.ТочкаМаршрута)
		И ЗначениеЗаполнено(Объект.ВидПеревозки)
		И ЗначениеЗаполнено(Сутки)
		И ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода);
КонецФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	Сутки = НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);
	
	СписокСостояний = Объект.СписокСостояний;
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.Прибыл);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.КачествоНеПринято);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.КачествоПринято);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.ВыгрузкаРазрешена);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.РезультатыПробПолучены);
	
	УстановитьПериод();
	
	ИнициализироватьОтборТочкаМаршрута();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОтборТочкаМаршрута()
	
	ИспользоватьНесколькоАЛЦ = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьНесколькоАЛЦ");
	
	Элементы.ОтборТочкаМаршрута.Доступность = ИспользоватьНесколькоАЛЦ;
	Элементы.ОтборТочкаМаршрута.РежимВыбораИзСписка = ИспользоватьНесколькоАЛЦ;
	
	АЛЦПользователя = Новый Массив;
	Объект.ТочкаМаршрута =
		гкс_ПриемкаТранспорта.ПЛКизНастроекБазыПользователя(ИспользоватьНесколькоАЛЦ, АЛЦПользователя);
	Если ИспользоватьНесколькоАЛЦ
		И ЗначениеЗаполнено(АЛЦПользователя) Тогда
		СписокВыбора = Элементы.ОтборТочкаМаршрута.СписокВыбора;
		СписокВыбора.ЗагрузитьЗначения(АЛЦПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСутки(КоличествоСуток)
	
	Сутки = Сутки + КоличествоСуток * гкс_ОбщегоНазначенияКлиентСервер.СекундВДне();
	
	ОбновитьПериодИСписки();

КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	
	НачалоПериода = гкс_ПриемкаТранспорта.НачалоПроизводственныхСуток(Сутки);
	КонецПериода = гкс_ПриемкаТранспорта.ОкончаниеПроизводственныхСуток(Сутки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодИСписки()
	
	// Устанавливаем период
	УстановитьПериод();
	
	// Заполняем список произвольного композита
	ЗаполнитьСписокПроизвольныйКомпозит();
	
КонецПроцедуры

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ОбработчикОжиданияСписок(Результат, ДополнительныеПараметры) Экспорт
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписок()
	ОбновитьСписки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписки()	
	ЗаполнитьСписокПроизвольныйКомпозит();
	ЗаполнитьСписокПромежуточныеПробы();	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСписокПроизвольныйКомпозит()
	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
	
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокПроизвольныйКомпозит = Обработка.ДанныеДляСписокПроизвольныйКомпозит(ПараметрыЗапроса);
	
	СписокПроизвольныйКомпозит.Очистить();
	СписокПроизвольныйКомпозит.Загрузить(ДанныеДляСписокПроизвольныйКомпозит);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПромежуточныеПробы()
	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
	
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокПромежуточныеПробы = Обработка.ДанныеДляСписокПромежуточныеПробы(ПараметрыЗапроса);
	
	СписокПромежуточныеПробы.Очистить();
	СписокПромежуточныеПробы.Загрузить(ДанныеДляСписокПромежуточныеПробы);
	
КонецПроцедуры

&НаСервере
Процедура СписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса)

	
	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеСписокРегистрацииПромежуточныхПроб = Обработка.ДанныеДляСписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса);
	
	СписокРегистрацииПромежуточныхПроб.Очистить();
	СписокРегистрацииПромежуточныхПроб.Загрузить(ДанныеСписокРегистрацииПромежуточныхПроб);
	
КонецПроцедуры


#КонецОбласти
